In [5]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in c:\programdata\anaconda3\lib\site-packages (2.8.3)

In [6]:
import pandas 
import configparser 
import psycopg2

we used Notebook ++ to add our info for configparser

In [7]:
config = configparser.ConfigParser()
config.read('config.ini')


host = config['myaws']['host']
user = config['myaws']['user']
pwd = config['myaws']['pwd']
database= config['myaws']['database']

establishing a connection to the database

if you need to change the information, you dont need to change the code, just change in notebook ++

In [8]:
conn = psycopg2.connect(
                        host = host,
                        user = user,
                        password = pwd,
                        dbname = database

)

creat a cursor

In [ ]:
cur = conn.cursor()

## Q1

In [19]:
sql_statement = '''
                select * from student_gp3
                '''

^^^ this is where we can design sql statements
can select bedrooms, bathrooms, where > 2

In [20]:
cur.execute(sql_statement)

In [25]:
df = pandas.read_sql_query(sql_statement,conn)
df[:]

,email,name,major
0,fsh@jmu.edu ...,sdf ...,IA
1,dsg@jmu.edu ...,sdg ...,IA
2,fdj@jmu.edu ...,ger ...,IA
3,df@jmu.edu ...,gre ...,IA

## Q2

In [31]:
sql_statement = '''
                select 
                cname, count(semail)
                from enroll_gp3
                group by cname
                order by count(semail) desc
                limit 1
                '''

In [32]:
df = pandas.read_sql_query(sql_statement,conn)
df[:]

                                               cname  count
0  IA 2                                          ...      1

## Q3

In [40]:
sql_statement = '''
                select 
                *
                from teacher_gp3
                inner join course_gp3
                on teacher_gp3.email = course_gp3.temail;
                '''

In [41]:
df = pandas.read_sql_query(sql_statement,conn)
df[:]

,email,tname,office,name,room,temail
0,weixx@jmu.edu ...,xeubin wei ...,hhs112,IA 1 ...,ISAT 100,weixx@jmu.edu ...
1,thoma7lm@jmu.edu ...,linda thomas ...,ISAT 312,IA 2 ...,ISAT 200,thoma7lm@jmu.edu ...
2,hendrinx@jmu.edu ...,noel hendrickson ...,ISAT 317,IA 3 ...,ISAT 300,hendrinx@jmu.edu ...
3,kolvoora@jmu.edu ...,bob kolvoord ...,ISAT 370,IA 4 ...,ISAT 400,kolvoora@jmu.edu ...
4,dum ...,dum ...,dum,dum ...,dum,dum ...
5,Hines ...,death ...,ISAT,death ...,isat,Hines ...
6,Hines ...,death ...,ISAT,IA 5 ...,ISAT 500,Hines ...

## Q4

In [46]:
sql_statement = '''
                select 
                tname, name
                from course_gp3
                inner join teacher_gp3
                on course_gp3.temail = teacher_gp3.email; 
               
                select
                tname, count(tname)
                from teacher_gp3
                group by tname
                order by count (tname) desc
                limit 1
                '''

In [47]:
df = pandas.read_sql_query(sql_statement,conn)
df[:]

                                               tname  count
0  bob kolvoord                                  ...      1

## Q5

In [60]:
sql_insert_statement = '''
                insert into teacher_gp3(email,tname,office)
                values('{}','{}','{}')
                '''.format('new_email1','new_name1','new_office1')
print(sql_insert_statement)

                insert into teacher_gp3(email,tname,office)
                values('new_email1','new_name1','new_office1')

In [61]:
cur.execute(sql_insert_statement)

In [62]:
conn.commit()

In [63]:
df = pandas.read_sql_query("select * from teacher_gp3", conn)
df[:]

,email,tname,office
0,dum ...,dum ...,dum
1,Hines ...,death ...,ISAT
2,new_email1 ...,new_name1 ...,new_office1
3,weixx@jmu.edu ...,xeubin wei ...,hhs112
4,thoma7lm@jmu.edu ...,linda thomas ...,ISAT 312
5,hendrinx@jmu.edu ...,noel hendrickson ...,ISAT 317
6,kolvoora@jmu.edu ...,bob kolvoord ...,ISAT 370

## Q6

In [74]:
sql_insert_statement = '''
                update course_gp3 
                set temail = 'new_email1'
                where temail = 'thoma7lm@jmu.edu'
                '''

In [75]:
cur.execute(sql_insert_statement)

In [76]:
conn.commit()

In [77]:
df = pandas.read_sql_query("select * from course_gp3", conn)
df[:]

,name,room,temail
0,IA 1 ...,ISAT 100,weixx@jmu.edu ...
1,IA 3 ...,ISAT 300,hendrinx@jmu.edu ...
2,IA 4 ...,ISAT 400,kolvoora@jmu.edu ...
3,dum ...,dum,dum ...
4,death ...,isat,Hines ...
5,IA 5 ...,ISAT 500,Hines ...
6,IA 2 ...,ISAT 200,new_email1 ...

In [81]:
sql_insert_statement = '''
                delete from teacher_gp3 
                where email = 'thoma7lm@jmu.edu'
                '''

In [82]:
cur.execute(sql_insert_statement)

In [83]:
conn.commit()

In [85]:
df = pandas.read_sql_query("select * from teacher_gp3", conn)
df[:]

,email,tname,office
0,dum ...,dum ...,dum
1,Hines ...,death ...,ISAT
2,new_email1 ...,new_name1 ...,new_office1
3,weixx@jmu.edu ...,xeubin wei ...,hhs112
4,hendrinx@jmu.edu ...,noel hendrickson ...,ISAT 317
5,kolvoora@jmu.edu ...,bob kolvoord ...,ISAT 370